---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ConduitType
source: html/ac07422d-abaf-2981-9c7e-ee8ec1663b57.htm
---
# ConduitType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.